# 03 Lectura de Datos Almacenados en Archivos

In [1]:
import pandas as pd

## CSV

In [3]:
# Lectura de archivos de datos
df = pd.read_csv('ds_salaries\\ds_salaries.csv')
df.head()

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 607 entries, 0 to 606
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Unnamed: 0          607 non-null    int64
 1   work_year           607 non-null    int64
 2   experience_level    607 non-null    object
 3   employment_type     607 non-null    object
 4   job_title           607 non-null    object
 5   salary              607 non-null    int64
 6   salary_currency     607 non-null    object
 7   salary_in_usd       607 non-null    int64
 8   employee_residence  607 non-null    object
 9   remote_ratio        607 non-null    int64
 10  company_location    607 non-null    object
 11  company_size        607 non-null    object
dtypes: int64(5), object(7)
memory usage: 57.0+ KB

In [6]:
df = pd.read_csv('ds_salaries\\ds_salaries.csv', header=None)
df.head(2)

,0,1,2,3,4,5,6,7,8,9,10,11
0,NaN,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
1,0.0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L

## XLSX

In [8]:
# pip install openpyxl
path = 'ds_salaries\\ds_salaries.xlsx'
df = pd.read_excel(path)
df.head(3)

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M

## JSON

In [10]:
df = pd.read_json('ds_salaries\\ds_salaries.json')
df.head(2)

,FIELD1,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S

## XML

In [11]:
df = pd.read_xml('ds_salaries\\ds_salaries.xml')
df.head(5)

,FIELD1,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

## HTML

In [12]:
df = pd.read_html('ds_salaries\\ds_salaries.htm')[0]
df.head()

,FIELD1,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

# EXPLORACION DE DATOS (Estadistica Basica)

In [13]:
df = pd.read_json('ds_salaries\\ds_salaries.json')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 607 entries, 0 to 606
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   FIELD1              607 non-null    int64
 1   work_year           607 non-null    int64
 2   experience_level    607 non-null    object
 3   employment_type     607 non-null    object
 4   job_title           607 non-null    object
 5   salary              607 non-null    int64
 6   salary_currency     607 non-null    object
 7   salary_in_usd       607 non-null    int64
 8   employee_residence  607 non-null    object
 9   remote_ratio        607 non-null    int64
 10  company_location    607 non-null    object
 11  company_size        607 non-null    object
dtypes: int64(5), object(7)
memory usage: 57.0+ KB

### Preguntas de Investigación

1. ¿Cual es el salario promedio?

In [23]:
sal = df['salary_in_usd']
mean = str(sal.mean())
print('Salario promedio: ' + mean)

Salario promedio: 112297.86985172982

2. Salario máximo y minimo en dolares:

In [22]:
max = str(sal.max())
min = str(sal.min())
print("Salario minimo: "+ min)
print("Salario maximo: "+ max)

Salario minimo: 2859
Salario maximo: 600000

3. ¿Cuantos pagos de salario se realizaron por divisa?

In [25]:
df.groupby(['salary_currency']).size()

salary_currency
AUD      2
BRL      2
CAD     18
CHF      1
CLP      1
CNY      2
DKK      2
EUR     95
GBP     44
HUF      2
INR     27
JPY      3
MXN      2
PLN      3
SGD      2
TRY      3
USD    398
dtype: int64

4. ¿Cual es el salario promedio por divisa convertido en dolares?

In [30]:
df_currency_usd_mean = df.groupby(['salary_currency'])['salary_in_usd'].mean()
df_currency_usd_mean.info()

<class 'pandas.core.series.Series'>
Index: 17 entries, AUD to USD
Series name: salary_in_usd
Non-Null Count  Dtype
--------------  -----
17 non-null     float64
dtypes: float64(1)
memory usage: 272.0+ bytes

In [31]:
df_currency_usd_mean.head(2)

salary_currency
AUD    87064.0
BRL    15904.0
Name: salary_in_usd, dtype: float64